# ==========================================================
# NASA ULTRA ENGINE – PART 1
# Imports + Constants
# ==========================================================

import random
import statistics
import numpy as np


# ==========================================================
# CONSTANTS
# ==========================================================

MAIN_RANGE = range(1, 38)   # מספרים ראשיים 1–37
EXTRA_RANGE = range(1, 8)   # מספר נוסף 1–7
HISTORY_SIZE = 200          # נזין אח"כ היסטוריה אמיתית
MC_RUNS = 5000              # מספר סימולציות למונטה-קרלו
